package com.zs.tixi.class40;

/**
 * 根据数据量猜解法（续）、分治技巧、卡特兰数
 *
 * 内容：
 *
 * 继续熟悉根据数据量猜解法
 *
 * 讲解分治法
 *
 * 讲解卡特兰数（课上证明的时候有小错，在40节开始处修正了）
 *
 * 题目：
 *
 * 给定一个非负数组arr，和一个正数m，返回arr的所有子序列中累加和%m之后的最大值
 *
 * 牛牛家里一共有n袋零食, 第i袋零食体积为v[i]，背包容量为w，牛牛想知道在总体积不超过背包容量的情况下,
 * 一共有多少种零食放法，体积为0也算一种放法
 * 1 <= n <= 30, 1 <= w <= 2 * 10^9，v[I] (0 <= v[i] <= 10^9）
 *
 * 假设给你N个0，和N个1，你必须用全部数字拼序列，返回有多少个序列满足任何前缀串，1的数量都不少于0的数量
 *
 * 有N个二叉树节点，每个节点彼此之间无任何差别，返回由N个二叉树节点，组成的不同结构数量是多少？
 *
 * 题目补充：	arr中的值可能为正，可能为负，可能为0，自由选择arr中的数字，能不能累加得到sum（多种做法）
 */
public class T {
}
