package com.zs.tixi.class18;

/**
 * Dijkstral算法优化：
 *      利用加强堆
 *      某个节点最短距离改变时做动态调整。
 *
 * 暴力递归：
 *      暴力递归就是尝试：
 *          1.把问题转化为了规模缩小了的同类问题的子问题。
 *          2.有明确的不需要进行递归的条件（base case）
 *          3.有得到了子问题之后的决策过程
 *          4.不记录每一个子问题的解。
 *
 * 熟悉什么叫尝试：
 *      1. 打印n层汉诺塔从最左边移动到最右边的全部过程。
 *      2. 打印一个字符串的全部子序列。
 *      3. 打印一个字符串的全部子序列，要求不要出现重复字面值的子序列。
 *      4. 打印一个字符串的全部排列。
 *      5. 打印一个字符串的全部排列，要求不要出现重复的排列。
 *
 * 仰望好的尝试：
 *      给你一个栈，请你逆序这个栈，不能申请额外的数据结构，只能使用递归函数，如何实现?
 *
 */
public class T {
}
