package com.zs.tixi.class24;

/**
 * 题目一：
 *      给定一个正数数组arr，
 *      请把arr中所有的数分成两个集合。尽量让两个集合的累加和接近。
 *      返回：
 *          最接近的情况下，较小集合的累加和。
 *
 * 题目二：
 *      给定一个正数数组arr，请把arr中所有的数分成两个集合。
 *      如果arr长度为偶数，两个集合包含数的个数要一样多。
 *      如果arr长度为奇数，两个集合包含的个数必须只差一个。
 *      请尽量让两个集合的累加和接近。
 *      返回：最接近情况下，较小集合的累加和。
 *
 * 题目三：N皇后问题
 *      在N*N的棋盘上要摆N个皇后。
 *      要求任何两个皇后不同行，不同列，也不在同一条斜线上。
 *      给定一个整数N，返回N皇后的摆法有多少种。
 *      N=1, 返回1
 *      N=2或3, 2皇后和3皇后问题无论怎么摆都不行，返回0
 *      N=8， 返回92
 */
public class T {
}
