package com.zs.tixi.class41;

/**
 * 子数组达到规定累加和的最大长度系列问题、矩阵处理技巧题
 *
 * 内容：
 *
 * 修正了39节卡特兰数讲解时的一个小错误
 *
 * 熟悉子数组达到规定累加和的三个模型（正、有正有负有0、累加和<=K）
 *
 * 矩阵处理技巧的宏观调度coding技巧
 *
 * 题目：
 *
 * 1. 给定一个正整数组成的无序数组arr，给定一个正整数值K，找到arr的所有子数组里，哪个子数组的累加和等于K
 * 并且是长度最大的，返回其长度
 *
 * 2. 给定一个整数组成的无序数组arr，值可能正、可能负、可能0，给定一个整数值K
 * 找到arr的所有子数组里，哪个子数组的累加和等于K，并且是长度最大的，返回其长度
 *
 * 3. 给定一个整数组成的无序数组arr，值可能正、可能负、可能0，给定一个整数值K
 * 找到arr的所有子数组里，哪个子数组的累加和<=K，并且是长度最大的，返回其长度
 *
 * 4. 给定一个数组arr，给定一个值v，求子数组平均值小于等于v的最长子数组长度
 *
 * 宏观调度
 *
 * 1. 给定一个正方形矩阵matrix，原地调整成顺时针90度转动的样子
 *
 * 2. 给定一个正方形或者长方形矩阵matrix，实现转圈打印
 *
 * 3. 给定一个正方形或者长方形矩阵matrix，实现zigzag打印
 *
 * 4. 转圈打印星号*问题
 */
public class T {
}
