package com.zs.tixi.class12;

/**
 * 1. 实现二叉树的按层遍历。
 *      1）其实就是宽度优先遍历，使用队列。
 * 2.
 *      二叉树可以通过先序，后序或按层遍历实现序列化和反序列化。请依次实现。
 * 3.    Leetcode 431.Encode N-ary Tree to Binary Tree
 *      请将一颗多叉树用二叉树表示，并可以还原回多叉树。
 * 4. 如何设计一个打印整颗树的打印函数。（将树结构打印成类似图像的形式）
 *
 * 5. 求二叉树最宽的层有多找个节点。
 *
 * 6. 二叉树结构如下定义：
 *      Class Node {
 *          V value;
 *          Node left;
 *          Node right;
 *          Node parent;
 *      }
 *      给你二叉树中的某个节点，返回后继节点。
 *
 * 7. 请把一段纸条竖着放在桌子上，然后从纸条的下边向上方对折1次，压出折痕后展开。
 *      此时折痕是凹下去的，即折痕突起的方向指向纸条的背面。如果从纸条的下边向上方连续对折两次，
 *      压出折痕后展开，此时有三条折痕，从上到下依次是凹折痕，凹折痕，凸折痕。
 *      给定一个输入参数N，代表纸条都从下边向上方连续对折N次。请从上到下打印所有折痕的方向。
 *      例如：N=1时，打印 “凹” . N=2时，打印 “凹”， “凹”， “凸”。
 */
public class T {
}
